import time


def welcome():
    print('-' * 25)
    print('Добро пожаловать в лучший телефонный справочник на этом компьютере!')
    menu()
    return vash_vibor()


def bye():
    print('Всего хорошего!\nДо новых встреч!')


def no_no():
    print('ваш выбор пока не реализован в справочнике, попробуйте выбрать что-то другое.\n')
    time.sleep(1)


def otkaz_izm():
    print('-' * 25)
    print('Этого я не смогу сделать. Начинай сначала (ты вышел за рамки дозволенного!)')
    print('-' * 25)
    time.sleep(1)


def vash_vibor():
    return input('Ваш выбор: ')


def chto_ishem():
    return input('введите строку поиска: ')


def ed_item_input():
    return input('Введите номер найденной записи: ')


def net_takogo():
    print('-' * 25)
    print('Хммм. нет такого. Если хотите то добавьте')
    print('-' * 25)
    time.sleep(1)


def vozvrat_g_menu():
    print('Ну, как знаете...\nТогда возвращаемся в главное меню.')
    time.sleep(1)


def pech_find_number(number: int):
    print(f'№ найденной записи: {number}')


def ask_want_izm():
    return input("Хотите отредактировать найденную запись? (1 - 'да', 2 - 'нет'): ")


def vse_verno():
    ansver = '!'
    while ansver:
        ansver = input("Всё верно? сохраняем? ('Да'=1, 'нет'=0):")
        if ansver == '1':
            return True
        elif ansver == '0':
            return False
        else:
            print('некорректный ввод, повторите.')
            time.sleep(1)
    return None


def menu():
    print('Пожалуйста, введите номер пункта для выбора операции:')
    print('-' * 25)
    print('[1] - Показать все имеющиеся контакты')
    print('[2] - Создать новый контакт')
    print('[3] - Редактировать имеющиеся контакт')
    print('[4] - Найти контакт')
    print('[5] - Удалить контакт')
    print('[6] - Выход из телефонного справочника')
    print('-' * 25)


def show_all_contacts(my_tel_spravochnik):
    # datas = ph_b_model.file_load()
    datas = my_tel_spravochnik.file_load()
    if not datas:
        print('*' * 25)
        print('В справочнике пока пусто! Скорее наполни его!!!')
        print('*' * 25)
        time.sleep(1)
    else:
        print('*' * 25)
        show_cart(datas)


def show_cart(datas: list | dict):
    tmp = []
    if type(datas) is dict:
        tmp.append(datas)
    else:
        tmp = datas
    for i in tmp:
        print(f'Имя        : {i['Name']}')
        print(f'Фамилия    : {i['Surname']}')
        print(f'Телефон(🔑): {i['Phone']}')
        print(f'Email      : {i['Email']}')
        print(f'Комментарии: {i['Comments']}')
        print('*' * 25)
        time.sleep(1)


def new_contact(my_tel_spravochnik):
    contact = dict()
    print('\n')
    print('*' * 25)
    print('Создание нового контакта:\n')
    contact['Name'] = input('Введите имя:')
    contact['Surname'] = input('Введите фамилию:')
    contact['Phone'] = input('Введите номер телефона:')
    contact['Email'] = input('Введите адрес электронной почты:')
    contact['Comments'] = input('Введите комментарии:')
    print('*' * 25)
    print('Вы ввели:\n')
    show_cart(contact)
    if vse_verno():
        # if ph_b_model.new_contact_add(contact):
        if my_tel_spravochnik.new_contact_add(contact):
            print('*' * 25)
            print('Готово!\nВозвращаемся в главное меню...')
            time.sleep(1)
        else:
            print('!!!ААА!!!')
            print('Всё пропало!')
            print('Контакт с таким номером телефона уже есь в базе!')
            print('А в нашей базе возможны только уникальные номера телефонов!')
            print('Никак не могу записать такое, сорри!')
            time.sleep(1)
    else:
        vozvrat_g_menu()


def search_contact_menu():
    print('Пожалуйста, введите номер пункта для выбора операции:')
    print('-' * 25)
    print('[1] - Поиск по имени')
    print('[2] - Поиск по фамилии')
    print('[3] - Поиск по телефону')
    print('[4] - Поиск по адресу электронной почты')
    print('[5] - Выход в главное меню')
    print('-' * 25)


def select_edit():
    print('-' * 25)
    print('Вообще-то, по хорошему, прежде чем изменять, объект неплохо было бы найти...')
    edit_item = input('Но если вы такой умный, то просто введите ID записи для изменения: ')
    return edit_item


def edit_contact_dialog(my_tel_spravochnik, vibor: dict):
    contact = dict()
    print('Добро пожаловать в режим редактирования существующих записей!')
    print('\n')
    print('*' * 25)
    print('Редактирование существующего контакта:\n')
    contact['Name'] = input(f'Имя (сейчас)        : {vibor['Name']}.  Введите новое имя: ')
    contact['Surname'] = input(f'Фамилия (сейчас)    : {vibor['Surname']}.  Введите новую фамилию: ')
    contact['Phone'] = input(f'Телефон (сейчас)    : {vibor['Phone']}.  Введите новый телефон: ')
    contact['Email'] = input(f'Email (сейчас)      : {vibor['Email']}.  Введите новый Email: ')
    contact['Comments'] = input(f'Комментарии (сейчас): {vibor['Comments']}.  Введите новые комментарии: ')
    print('*' * 25)
    print('Вы ввели:\n')
    show_cart(contact)
    contact['ID'] = vibor['ID']
    if vse_verno():
        # ph_b_model.edit_contact(vibor, contact)
        my_tel_spravochnik.edit_contact(vibor, contact)
        print('*' * 25)
        print('Готово! Все поменяно!')
        time.sleep(1)
        return True
    else:
        return False


def select_delete():
    print('-' * 25)
    print('Вообще-то, по хорошему, прежде чем удалять, объект неплохо было бы найти...')
    del_item = input('Но если вы такой умный, то просто введите ID записи для удаления: ')
    return del_item


def delete_contact_dialog():
    print('*' * 25)
    print('Всё! Хана! Удалили насмерть!')
    print('-' * 25)
    time.sleep(1)


if __name__ == '__main__':
    print('Запускайте ph_b_controller.py!')
